<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Schafkopf-devel] Re: Schafkopf
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/schafkopf-devel/2005-February/index.html" >
   <LINK REL="made" HREF="mailto:schafkopf-devel%40lists.berlios.de?Subject=Re%3A%20%5BSchafkopf-devel%5D%20Re%3A%20Schafkopf&In-Reply-To=%3C200502201209.23423.domseichter%40web.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000080.html">
   <LINK REL="Next"  HREF="000082.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Schafkopf-devel] Re: Schafkopf</H1>
    <B>Dominik Seichter</B> 
    <A HREF="mailto:schafkopf-devel%40lists.berlios.de?Subject=Re%3A%20%5BSchafkopf-devel%5D%20Re%3A%20Schafkopf&In-Reply-To=%3C200502201209.23423.domseichter%40web.de%3E"
       TITLE="[Schafkopf-devel] Re: Schafkopf">domseichter at web.de
       </A><BR>
    <I>Sun Feb 20 12:09:22 CET 2005</I>
    <P><UL>
        <LI>Previous message: <A HREF="000080.html">[Schafkopf-devel] Commit Report - Schafkopf TODO: umlaute entfernt
</A></li>
        <LI>Next message: <A HREF="000082.html">[Schafkopf-devel] Commit Report - Schafkopf unterstrichen ist sch&#246;ner als haessliches
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#81">[ date ]</a>
              <a href="thread.html#81">[ thread ]</a>
              <a href="subject.html#81">[ subject ]</a>
              <a href="author.html#81">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Hallo Dominik,

Am Saturday, 19. February 2005 22:09 schrieben Sie:
&gt;<i> danke f&#252;r deine Implementierung des Schafkopf-Spiels, danach hab ich schon
</I>&gt;<i> lange gesucht!
</I>Danke. Ich muss aber noch dazu sagen, dass ich das nicht alleine mache sondern 
wir sind im Moment 4 Entwickler.

&gt;<i> Ein paar Kritikpunkte hab ich dennoch anzumerken:
</I>&gt;<i> - Die Spielkarten sind teilweise etwas schlecht zu erkennen (Unter, Ober,
</I>&gt;<i> etc). K&#246;nnte man daf&#252;r Scans von original Karten verwenden, oder spricht da
</I>&gt;<i> etwas dagegen (Copyrights, etc.)?
</I>Kann man. Wir haben im Forum eine kleine HOWTO gebaut wie man sich ein eigenes 
Kartenset erstellen kann: <A HREF="http://www.kbarcode.net/forum/viewtopic.php?t=210">http://www.kbarcode.net/forum/viewtopic.php?t=210</A>

Einfach Karten einscannen und mit geben ist aus Copyright gr&#252;nden nicht 
m&#246;glich soweit ich wei&#223; (ich lasse mich nat&#252;rlich gerne eines besseres 
belehren - leider hat es noch keiner geschafft :-( :-( :-( ).

&gt;<i> - Das Hineinlegen von Karten und das Nehmen des Stichs k&#246;nnte besser
</I>&gt;<i> animiert werden. Das w&#252;rde das Spiel etwas lebendiger machen.
</I>Dar&#252;ber haben wir schon nachgedacht. Im Moment nutzen wir unsere wenige Zeit 
allerdings eher f&#252;r Netzwerk Modus (damit fangen wir geraden an) und KI.

&gt;<i> - Es sollte standardm&#228;&#223;ig schon ein Kartentyp eingestellt sein. Es hat mich
</I>&gt;<i> anfangs sehr verwirrt, da&#223; ich keine Karten sehen konnte. Ich hab erstmal
</I>&gt;<i> diverse png Libaries nachinstalliert, weil ich dachte es k&#246;nnte da irgendwo
</I>&gt;<i> der Fehler drin liegen. Hat etwas gedauert bis ich drauf gekommen bin, da&#223;
</I>&gt;<i> man erst einen Kartentyp festlegen mu&#223;.
</I>Hu. Das sollte nat&#252;rlich nicht so sein. Mit welcher version passiert Dir das? 
Ich kann das mit aktueller CVS nicht reproduzieren.

&gt;<i> Ich hab mir den Source-Code noch nicht angeschaut, aber vielleicht k&#246;nntest
</I>&gt;<i> du mir kurz sagen, wie die Spielregeln eigentlich implementiert sind. Gibt
</I>&gt;<i> es daf&#252;r ein einigerma&#223;en abstrahiertes Interface, oder m&#252;&#223;te man f&#252;r die
</I>&gt;<i> Ver&#228;nderung der Spielregeln den gesamten Code ver&#228;ndern?
</I>&gt;<i> Mir pers&#246;nlich ist n&#228;mlich das 6-Blatt-Spiel wesentlich lieber. Und ich
</I>&gt;<i> dachte mir, wenn ich mal Zeit hab (und es nicht zu kompliziert ist) k&#246;nnte
</I>&gt;<i> ich ja mal versuchen, Schafkopf um ein 6-Blatt-Spiel zu erweitern. Bisher
</I>&gt;<i> hab ich mit C++ noch nichts im praktischen Sinne gemacht (mein Ding ist
</I>&gt;<i> eher Java), aber das w&#228;re ein gutes Projekt, um C++ im praktischen Einsatz
</I>&gt;<i> kennenzulernen.
</I>Ich denke es sollte nicht allzu kompliziert sein, obwohl ich mich nat&#252;rlich 
leicht tue das zu sagen, da ich den Code ja schon kenne ;).

Ich bin mir jetzt erlich gesagt nicht sicher bei den Regeln des 6-Blatt 
Spieles: Wird das mit 24 oder 32 Karten gespielt?

Falls mit 24 Karten gespielt wird musst CardList::init() ab&#228;ndern, so dass die 
CardList auch wahlweise mit nur 24 Karten initialisiert werden kann und nicht 
immer mit 32.

Auf jeden Fall sollten es eine Option geben, z.B. bool 
Settings::instance()-&gt;is6CardGame(), das kannst Du erst mal hardcoden, dass 
es true zur&#252;ck gibt. Die &#196;nderungen f&#252;r den Preferences Dialog kann dann auch 
ich machen. Das sollte dann an allen relevanten Stellen abgefragt werden,

Da wir bisher faul waren haben wir im ganzen Code folgende Constanten 
verwendet (schafkopfdef.h):

#define PLAYERS   4
#define NUMCARDS  8
#define TURNS     8
#define CARD_CNT  32

Die stimmen beim 6 Blatt spiel nat&#252;rlich nicht mehr. Daher sollten Da 
Variablen draus gemacht werden (am besten Properties von Game w&#252;rde ich 
sagen) die dann auch in Game initialisiert werden (im Konstruktor) je nach 
Settings::instance()-&gt;is6CardGame().

Spontan ist das alles was mir einf&#228;llt. Gibt aber sicher noch ein paar Dinge 
an die ich noch nicht gedacht habe, aber da wirst Du ja dann dar&#252;ber 
stolpern.

Wichtig ist noch, Du solltest mit der aktuellen CVS Version arbeiten. Und Du 
solltest die Mailingliste abonnieren 
(<A HREF="https://lists.berlios.de/mailman/listinfo/schafkopf-devel">https://lists.berlios.de/mailman/listinfo/schafkopf-devel</A>), die wird Dir 
nat&#252;rlich auch gerne bei allen Fragen helfen.

Sobald Du &#228;nderungen hast kannst Du einfach einen Patch an die Mailingliste 
schicken und wir stellen das so schnell wie m&#246;glich f&#252;r Dich ins CVS.

So, ich hoffe ich hab nichts wichtiges vergessen:
 Happy hacking!

CU Dom
-- 
**********************************************************************
Dominik Seichter - <A HREF="https://lists.berlios.de/mailman/listinfo/schafkopf-devel">domseichter at web.de</A>
KRename  - <A HREF="http://www.krename.net">http://www.krename.net</A>  - Powerful batch renamer for KDE
KBarcode - <A HREF="http://www.kbarcode.net">http://www.kbarcode.net</A> - Barcode and label printing
KDE Mass Mailer - <A HREF="http://www.kmassmailer.net">http://www.kmassmailer.net</A> - Mass mailing for KDE
SchafKopf - <A HREF="http://schafkopf.berlios.de">http://schafkopf.berlios.de</A> - Schafkopf, a card game,  for KDE
**********************************************************************

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000080.html">[Schafkopf-devel] Commit Report - Schafkopf TODO: umlaute entfernt
</A></li>
	<LI>Next message: <A HREF="000082.html">[Schafkopf-devel] Commit Report - Schafkopf unterstrichen ist sch&#246;ner als haessliches
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#81">[ date ]</a>
              <a href="thread.html#81">[ thread ]</a>
              <a href="subject.html#81">[ subject ]</a>
              <a href="author.html#81">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/schafkopf-devel">More information about the Schafkopf-devel
mailing list</a><br>
</body></html>
